; domain
(define (domain cleaner_robot)
    (:requirements :strips)

    (:predicates
        (robot-location ?o)
        (box-location ?b ?o)
        (dirty ?o)
        (clean ?o)
        (empty ?o)
        (adjacent ?o1 ?o2)
    )

    ; ------ ACTIONS ------
    (:action clean_office
        :parameters (?o)
        :precondition (and (robot-location ?o) (dirty ?o))
        :effect (and (not(dirty ?o)) (clean ?o))
    )

    (:action move
        :parameters (?o1 ?o2)
        :precondition (and (robot-location ?o1) (adjacent ?o1 ?o2))
        :effect (and (robot-location ?o2))
    )

    (:action push
        :parameters (?b ?o1 ?o2)
        :precondition (and (robot-location ?o1) (box-location ?b ?o1) (empty ?o2) (adjacent ?o1 ?o2))
        :effect (and (box-location ?b ?o2) (not(box-location ?b ?o1)) (not(empty ?o2)) (empty ?o1))
    )
)

; problem
(define (problem smaller_problem) (:domain cleaner_robot)
(:objects 
    o1 o2 o3 o4
    bA
)

(:init
    (adjacent o1 o2) (adjacent o1 o3) (adjacent o2 o1) (adjacent o2 o4) (adjacent o3 o1) (adjacent o3 o4) (adjacent o4 o2) (adjacent o4 o3)
    (robot-location o1)
    (box-location bA o1)
    (empty o2)
    (dirty o1) (dirty o4)
    (clean o2) (clean o3)
)

(:goal (and
    (clean o1) (clean o2) (clean o3) (clean o4)
    (box-location bA o2)
    (empty o1)
))
)

; plan
1. (clean_office o1)
   deleted: (dirty o1)
   added: (clean o1)
   goals met: 3 of 6
2. (push ba o1 o2)
   deleted: (box-location ba o1) (empty o2)
   added: (box-location ba o2) (empty o1)
   goals met: 5 of 6
3. (move o1 o2)
   added: (robot-location o2)
   goals met: 5 of 6
4. (move o2 o4)
   added: (robot-location o4)
   goals met: 5 of 6
5. (clean_office o4)
   deleted: (dirty o4)
   added: (clean o4)
   goals met: 6 of 6
